# First Review of datasets

This notebook was to use description methods to evaluate the first 2 datasets.

- collections/data/TemporaryExhibitionsatTateModern2008to2016Public.xlsx
- kpis/data/Monthly_and_Quarterly_Visits_to_DCMS-Sponsored_Museums_and_Galleries_-_to_June_2025_data_tables.ods

In [1]:
# Uncomment the rows below to install some packages for xlsx and ods files
# %pip install openpyxl
# %pip install odfpy

Requirement already satisfied: openpyxl in c:\users\johig\appdata\local\programs\python\python314\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\johig\appdata\local\programs\python\python314\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: odfpy in c:\users\johig\appdata\local\programs\python\python314\lib\site-packages (1.4.1)
Requirement already satisfied: defusedxml in c:\users\johig\appdata\local\programs\python\python314\lib\site-packages (from odfpy) (0.7.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [4]:
exhibit_df = pd.read_excel('../data/tate_modern_temporary_exhibitions_2008to2016_public.xlsx')
monthly_visit_df = pd.read_excel('../../kpis/data/Monthly_and_Quarterly_Visits_to_DCMS-Sponsored_Museums_and_Galleries_-_to_June_2025_data_tables.ods', sheet_name = '2a')

In [5]:
exhibit_df.columns

Index(['ID', 'Exhibition', 'Space', 'Era', 'Country', 'Medium',
       'Type of Exhibition', 'Principal Artist', 'Start Day', 'End Day',
       'Duration', 'Report Year', 'Visitors', 'Charge?', 'Co-Organisers',
       'Sponsors', 'Link', 'Description', 'A review with more info'],
      dtype='object')

In [6]:
exhibit_df.head(10)

,ID,Exhibition,Space,Era,Country,Medium,Type of Exhibition,Principal Artist,Start Day,End Day,Duration,Report Year,Visitors,Charge?,Co-Organisers,Sponsors,Link,Description,A review with more info
0,1,Mona Hatoum,NaN,Contemporary,"Lebanon, UK","Sculpture, Installation",Artist,Mona Hatoum,2016-05-04,2016-08-21,109.0,2016-17,NaN,Paid,"Centre Pompidou, Musée National d’Art Moderne,...",AGC Equity Partners with additional support fr...,http://www.tate.org.uk/whats-on/tate-modern/ex...,"Born in Beirut to a Palestinian family, Mona H...",NaN
1,2,Georgia O’Keeffe,NaN,Modernism,USA,Painting,Artist,Georgia O’Keeffe,2016-07-06,2016-10-30,116.0,2016-17,NaN,Paid,-,Art Mentor Foundation Lucerne with additional ...,http://www.tate.org.uk/whats-on/tate-modern/ex...,Georgia O’Keeffe is best known for her paintin...,NaN
2,3,Bhupen Khakhar: You Can’t Please All,NaN,Post-War,India,Painting,Artist,Bhupen Khakhar,2016-06-01,2016-11-06,158.0,2016-17,NaN,Paid,-,Deutsche Bank. Supported by Kiran Nadar Museum...,http://www.tate.org.uk/whats-on/tate-modern/ex...,Renowned for his unique figurative style and i...,NaN
3,4,Anne Teresa de Keersmaeker: Work / Travail / A...,Turbine Hall,Contemporary,Belgium,Performance,Performance,Anne Teresa de Keersmaeker:,2016-07-08,2016-07-10,2.0,2016-17,NaN,Free,-,"Rosas, Ictus, WIELS, with support of the BNP ...",http://www.tate.org.uk/whats-on/tate-modern/ex...,What would it mean for choreography to perform...,NaN
4,5,The EY Exhibition: Wifredo Lam,NaN,Modernism,Cuba,Painting,Artist,Wilfredo Lam,2016-09-14,2017-01-08,116.0,2016-17,NaN,Paid,"Centre Pompidou, Musée national d’art moderne,...",EY Tate Arts Partnership,http://www.tate.org.uk/whats-on/tate-modern/ex...,Wifredo Lam’s distinctive style shook the assu...,NaN
5,6,Robert Rauschenberg,NaN,Post-War,USA,Mixed,Artist,Robert Rauschenberg,2016-12-01,2017-04-02,122.0,2016-17,NaN,Paid,"The Museum of Modern Art, New York",Bank of America Merrill Lynch. Supporting Spon...,http://www.tate.org.uk/whats-on/tate-modern/ex...,Robert Rauschenberg blazed a new trail for art...,NaN
6,7,The Radical Eye: Modernist Photography from th...,NaN,Modernism,Mixed,Photography,Collection,-,2016-11-10,2017-05-21,192.0,2016-17,NaN,Paid,-,-,http://www.tate.org.uk/whats-on/tate-modern/ex...,This is a once-in-a-lifetime chance to see one...,NaN
7,8,Hyundai Commission: Philippe Parreno – Anywhen,Turbine Hall,Contemporary,France,Installation,Miniature / One off,Philippe Parreno,2016-10-04,2017-04-02,180.0,2016-17,NaN,Free,NaN,"Hyundai Motor. With support from Kvadrat, LUMA...",http://www.tate.org.uk/whats-on/tate-modern/ex...,Prepare to have your senses activated and stim...,NaN
8,9,BMW Tate Live Exhibition: Ten Days Six Nights,The Tanks,Contemporary,Mixed,Mixed,Mixed,-,2017-03-24,2017-04-02,9.0,2016-17,NaN,Both,NaN,BMW,http://www.tate.org.uk/whats-on/tate-modern/ex...,"Situated in the Tanks, the first BMW Tate Live...",NaN
9,10,Wolfgang Tillmans: 2017,NaN,Contemporary,Belgium,Mixed,Artist,Wolfgang Tillmans,2017-02-15,2017-06-11,116.0,2016-17,NaN,Paid,NaN,Hyundai Cars. With additional support from Tat...,http://www.tate.org.uk/whats-on/tate-modern/ex...,What are we to make of the world in which we f...,NaN

In [7]:
exhibit_df.sample(5)

,ID,Exhibition,Space,Era,Country,Medium,Type of Exhibition,Principal Artist,Start Day,End Day,Duration,Report Year,Visitors,Charge?,Co-Organisers,Sponsors,Link,Description,A review with more info
19,20,Alibis: SIgmar Polke 1963-2010,NaN,"Post-War, Contemporary",Germany,Mixed,Artist,Sigmar Polke,2014-10-09,2015-02-08,122.0,2014-15,NaN,Paid,Moma,Fergus McCaffrey with additional support from ...,http://www.tate.org.uk/whats-on/tate-modern/ex...,Sigmar Polke was one of the most insatiably ex...,NaN
12,13,Hyundai Commission 2015: Abraham Cruzvillegas:...,Tubrine Hall,Contemporary,Mexico,Installation,Miniature / One off,Abraham Cruzvillegas,2015-10-13,2016-04-03,173.0,2015-16,NaN,Free,NaN,"Hyundai Motor and Tate Modern, Terra Foundatio...",http://www.tate.org.uk/whats-on/tate-modern/ex...,Empty Lot is a large geometric sculpture creat...,NaN
62,63,Level 2 Gallery: Alejandro Cesarco,Level 2,Contemporary,Uruguay,Film,Miniature / One Off,Alejandro Cesarco,2010-07-10,2010-10-31,113.0,2010-11-01 00:00:00,NaN,Free,NaN,NaN,http://www.tate.org.uk/whats-on/tate-modern/ex...,Uruguayan artist Alejandro Cesarco pays specia...,NaN
26,27,Meschac Gaba: Museum of Contemporary African A...,NaN,Contemporary,Benin,Installation,Miniature / One off,Meschac Gaba,2013-07-03,2013-09-22,81.0,2013-14,NaN,Free,NaN,Guaranty Trust Bank Plc.,http://www.tate.org.uk/whats-on/tate-modern/ex...,NaN,NaN
31,32,Richard Hamilton,NaN,Post-War,UK,Mixed,Artist,Richard Hamilton,2014-02-13,2014-05-26,102.0,2013-14,NaN,Paid,NaN,The Richard Hamilton Exhibition Supporters Gro...,http://www.tate.org.uk/whats-on/tate-modern/ex...,One of the most influential British artists of...,NaN

In [8]:
# Only 4 numerical columns.  Need to specify
exhibit_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 95 entries, 0 to 94
Data columns (total 19 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID                       95 non-null     int64
 1   Exhibition               94 non-null     object
 2   Space                    40 non-null     object
 3   Era                      94 non-null     object
 4   Country                  94 non-null     object
 5   Medium                   93 non-null     object
 6   Type of Exhibition       94 non-null     object
 7   Principal Artist         81 non-null     object
 8   Start Day                94 non-null     datetime64[ns]
 9   End Day                  94 non-null     datetime64[ns]
 10  Duration                 94 non-null     float64
 11  Report Year              94 non-null     object
 12  Visitors                 11 non-null     object
 13  Charge?                  94 non-null     object
 14  Co-Organisers            18 non-null     object
 15  Sponsors                 44 non-null     object
 16  Link                     94 non-null     object
 17  Description              93 non-null     object
 18  A review with more info  0 non-null      float64
dtypes: datetime64[ns](2), float64(2), int64(1), object(14)
memory usage: 14.2+ KB

In [9]:
exhibit_df.shape

(95, 19)

In [10]:
exhibit_df.describe()

,ID,Start Day,End Day,Duration,A review with more info
count,95.000000,94,94,94.000000,0.0
mean,48.000000,2011-12-22 06:22:58.723404288,2012-04-29 03:34:28.085106432,128.882979,NaN
min,1.000000,2007-08-16 00:00:00,2008-04-06 00:00:00,2.000000,NaN
25%,24.500000,2009-07-08 06:00:00,2010-01-04 18:00:00,93.250000,NaN
50%,48.000000,2011-10-08 12:00:00,2012-01-08 00:00:00,109.000000,NaN
75%,71.500000,2014-01-23 06:00:00,2014-05-15 06:00:00,141.000000,NaN
max,95.000000,2017-03-24 00:00:00,2017-06-11 00:00:00,1414.000000,NaN
std,27.568098,NaN,NaN,141.169376,NaN

In [11]:
# The header is not the first row!  This adjusts the row and ignores the notes at the top
monthly_visit_df.columns = monthly_visit_df.iloc[2]
monthly_visit_df = monthly_visit_df[2:]
monthly_visit_df.columns

Index(['Museum Name ', 'Coverage', 'Month', '2004/2005', '2005/2006',
       '2006/2007', '2007/2008', '2008/2009', '2009/2010', '2010/2011',
       '2011/2012', '2012/2013', '2013/2014', '2014/2015', '2015/2016',
       '2016/2017', '2017/2018', '2018/2019'],
      dtype='object', name=2)

In [12]:
monthly_visit_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 755 entries, 2 to 756
Data columns (total 18 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Museum Name   755 non-null    object
 1   Coverage      755 non-null    object
 2   Month         755 non-null    object
 3   2004/2005     755 non-null    object
 4   2005/2006     755 non-null    object
 5   2006/2007     755 non-null    object
 6   2007/2008     755 non-null    object
 7   2008/2009     755 non-null    object
 8   2009/2010     755 non-null    object
 9   2010/2011     755 non-null    object
 10  2011/2012     755 non-null    object
 11  2012/2013     755 non-null    object
 12  2013/2014     755 non-null    object
 13  2014/2015     755 non-null    object
 14  2015/2016     755 non-null    object
 15  2016/2017     755 non-null    object
 16  2017/2018     755 non-null    object
 17  2018/2019     755 non-null    object
dtypes: object(18)
memory usage: 106.3+ KB

In [13]:
#This does not work as there are no numeric datatypes - need to change data types from object tointeger.
#include = 'all' added to review values in text form
monthly_visit_df.describe(include = "all")

2,Museum Name,Coverage,Month,2004/2005,2005/2006,2006/2007,2007/2008,2008/2009,2009/2010,2010/2011,2011/2012,2012/2013,2013/2014,2014/2015,2015/2016,2016/2017,2017/2018,2018/2019
count,755,755,755,755,755,755,755,755,755,755,755,755,755,755,755,755,755,755
unique,60,4,15,650,656,632,644,644,658,662,663,660,663,657,508,508,508,392
top,SIR JOHN SOANE'S MUSEUM,Museum site,April,x,x,x,x,x,x,x,x,x,x,x,x,x,x,x
freq,13,494,58,103,97,119,111,107,97,91,92,89,88,91,247,247,247,364

In [14]:
# Some shorthand is used in this table, x = data not available. Not NaN!
monthly_visit_df.sample(10)

2,Museum Name,Coverage,Month,2004/2005,2005/2006,2006/2007,2007/2008,2008/2009,2009/2010,2010/2011,2011/2012,2012/2013,2013/2014,2014/2015,2015/2016,2016/2017,2017/2018,2018/2019
647,T&W SEGEDUNUM,Museum site,November,3930,3600,3546,3969,4609,4581,14734,12233,12007,14296,14498,x,x,x,x
561,T&W ARBEIA,Museum site,Financial Year Running Total,98248,96293,79285,78588,66938,48235,41974,49338,28380,30622,32037,x,x,x,x
525,WALLACE COLLECTION,Museum group,June,21473,18264,20039,28458,29988,25818.24,28490.08,33413,31450,34333,32309,37346,33087,38135,34681
699,T&W STEPHENSON,Museum site,November,409,149,146,467,463,1208,456,156,897,1464,1529,x,x,x,x
711,T&W SUNDERLAND,Museum site,October,22650,30294,29334,26235,24620,25300,27343,26671,29515,26476,33123,x,x,x,x
42,HORNIMAN MUSEUM (Excluding visits to the garden),Museum group,April,29082,22371,27718,43133,44533,63848,65009,46675,55508,61383,72941,83330,70227,92641,87228
504,V&A BLYTHE HOUSE,Museum site,November,x,391,275,237,394,382,251,340,336,561,538,630,684,703,665
73,IWM LONDON,Museum site,September,48592,39296,49312,50229,54364,59479,86581,65570,70360,65558,138813,76328,77358,72563,74975
192,ROYAL MUSEUMS GREENWICH,Museum group,November,71910,89541,88846,92879,104292,101225,109557,114862,149572,141732,127062,130511,149001,149172,154497
256,SMG NATIONAL RAILWAY MUSEUM,Museum site,October,82422,77559,83204,76725,80323,73350,64535,75175,60830,103547,69966,72466,71659,68383,82861

In [15]:
# I am having trouble with 'Museum Name' being recognised as the column name so I am using iloc  I will rename the columns.
condition = monthly_visit_df.iloc[:, 0].isin(["TATE TOTAL"])
tate_total_df = monthly_visit_df[condition]

In [16]:
#saving a dataframe as an csv
tate_total_df.to_csv('../data/tate_total_footfall_summary.csv', index = False)